# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом.
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
# Выведите минимальное количество монет, которые нужно перевернуть
# *Пример:
# 5 -> 1 0 1 1 0
# Ответ: 2


from random import randint

tries = int(input("Ввидите число монет монет на столе: "))

mon_coin = []

while tries:
    mon_coin.append(randint(1, 2))
    tries -= 1

print('рел - {}, решка - {}'.format( mon_coin.count(1), mon_coin.count(2)))


